
# NameError როცა დასახელებული ცვლადი არ არის დადგენლი/შექმნილი
# TabeError როცა შეცდომა ინდენტაციაშა
# indexError როცა ისეთი ინდექსი დავასახელეთ ან გამოვიძახეთ რომელის სიაში/სტრინგში არ არის, გასულია ინდექსებს გარეთ.
# valueError როცა ცვლადის მნიშვნელობა არ შეესაბამება იმ ფუნქციის ლოგიკას რომელსაც ვანიჭებთ

try:
    print("Hello") # without ""
except:
    print("ცვლადი არ არის შედგენილი")


list=[1,2,3]
try:
    print(list[3])
except:
    print("ეს ინდექსი არ მოიძებნა კონკრეტულ მნიშვნელობაში")


try:
    abc=int("abc")
except:
    print("ასოებს ციფრებად ვერ გადააქცევ, ეს შეცდომაა")