// New keywordის გამოყენებით 
// შექმენით ლისთი რომელშიც შეინახავთ 5 სხვადასხვა ელემენტს, შემდეგ ინდექსინგის გამოყენებით გამოიტანეთ კონსოლში ყველა ეს ელემენტი
let List1 = new Array(10, "hello", 3.14, true, [1, 2, 3]);

console.log(List1[0]); 
console.log(List1[1]); 
console.log(List1[2]); 
console.log(List1[3]); 
console.log(List1[4]); 

// შექმენით ლისთი New Keywordოს გამოყენებით რომელსაც არგუმენტად მისცემთ 4ს, კომენტარების დახმარებით ახსენით რას ნიშნავს ეს 4

let List2= new Array(4);

// ამით ჩვენ ვუთითებთ რომ ვქმნით სიას(Array) რომლის სიგრძე იქნება 4 ანუ მასში იქნება ოთხი მონაცემი.

// შექმენით ლისთი New keywordის გამოყენების გარეშე და შეინახეთ 3 ელემენტი

let List3 = [10, "hello", true];

// შექმენით ცარიელი Array, რომელსაც დაამატებთ თქვენს სახელს, გვარს და ასაკს. დაამსგავსეთ ის Associative
//  Arrayს, შემდეგ კი ახსენით, რატომ აჩვენებს Array ზომა 0ს

let Array = [];
myArray["name"] = "Teodore";    
myArray["surname"] = "ratiani";   
myArray["age"] = 15;          

console.log(Array);        
console.log(Array.length);

//  რადგან ის მათ არ აღიქვამს ელემენტებად, არამედ ობიექტად რის გამოც მისი ზომა აღარ იცვლება. lenght აღიქვამს 
// მარტო რიცხვით ინდექს და როცა ასეთი ობიექტებია მათ უბრალოდ არ ითვლის
