
// Document Object Model არის პროგრამული ინტერფეისი, და არის ვებ-გვერდის სტრუქტურა ხის მსგავსად. იგი ბრაუზერის მიერ იქმნება და დეველოპერებს საშუალებას აძლევს შეცვალონ, დაამატონ ან წაშალონ HTML ელემენტები, ატრიბუტები და სტილები.

// Console  არის დეველოპერული ხელსაწყოების ნაწილი, რომელიც გამოიყენება ვებ-გვერდების გაშვებისას შეცდომების გასაშიფრად, კოდის გასატესტად და მონაცემების საჩვენებლად. იგი ძირითადად ბრაუზერის Devtools გვხვდება და ასევე გამოიყენება Node.js-ისთბის.

// let არის ცვლადის გამოცხადების keyword JavaScript-ში. 


// 3) შექმენით 2 Number ტიპის ცვლადი, დაამატეთ ერთმანეტს და გამოიტანეთ console'ში

let num1 = 15

let num2 = 20

let sum= num1 + num2

console.log("sum:", sum)