
// გააუმჯობესეთ გაკვეთილზე შესრულებული მეორე პროექტი. დარეგისტრირებული მომხმარებლების სია შეინახეთ localStorage-ში.

// დაამატეთ შემდეგი ფუნქციონალი:

// წინასწარ მოამზადეთ ადმინისტრატორის ექაუნთი(ანუ მისი მონაცემები თავიდანვე უნდა იყოს ჩამატებული მომხმარებლების სიაში). ავტორიზაციისას, ჩვეულებრივ მომხმარებელს საიტზე უნდა გმოუჩნდეს მისი ექაუნთის მონაცემები(ჩაანაცვლეთ გაკვეთილზე შექმნილი alert-ი)
// ადმინისტრატორს უნდა შეეძლოს ყველა შექმნილი მონაცემის ნახვა და ნებისმიერი სხვა მომხმარებლის ექაუნთის წაშლა.
// ყოველი ახალი ექაუნთის დამატებისას/წაშლისას განაახლეთ localStorage-ი.