

// DOM  არის ვებ-დოკუმენტის შიდა სტრუქტურის წარმოდგენა, რომელიც საშუალებას აძლევს პროგრამებს, მაგალითად, JavaScript-ს, შეასრულოს მანიპულაციები და ინტერაქცია ვებ-გვერდის შინაარსთან და სტრუქტურასთან

// number
// გამოიყენება რიცხვების შესანახად, მაგალითად, მთელი რიცხვები და ათწილადი რიცხვები.

// string
// გამოიყენება ტექსტის შესანახად.

// boolean
// ლოგიკური ტიპი, რომელიც ორი მნიშვნელობიდან ერთ-ერთს იღებს: true ან false.

// undefined
// ნიშნავს, რომ ცვლადი არსებობს, მაგრამ მასში მნიშვნელობა არ არის მინიჭებული.

// null
// ცხადი მინიშნება, რომ ცვლადში მნიშვნელობა არ არის (და არა undefined).

// symbol
// უნიკალური და უცვლელი მნიშვნელობა, რომელიც ხშირად გამოიყენება ობიექტის გასაღებად.

// igint
// გამოიყენება ძალიან დიდი რიცხვების შესანახად, რომლებიც number ტიპს არ შეუძლია შეინახოს.

let heading = document.getElementById('main-heading');
console.log(heading)